{
    "reminders": [
        {
            "title": "Morning Remembrance",
            "text": "Start your day with 'Subhanallahi wa bihamdihi' (Glory and praise be to Allah) 100 times. The Prophet ﷺ said: 'Whoever says this 100 times in the morning and evening will not be surpassed on the Day of Judgment by anyone having done better than this except for someone who had said the same or more.'",
            "source": "Sahih Muslim"
        },
        {
            "title": "Eating Etiquette",
            "text": "Remember to eat with your right hand and say 'Bismillah' before eating. The Prophet ﷺ said: 'When one of you eats, he should eat with his right hand and when he drinks, he should drink with his right hand.'",
            "source": "Sahih Muslim"
        },
        {
            "title": "Kindness to Parents",
            "text": "Show kindness to your parents daily. The Prophet ﷺ was asked about the best of deeds, he said: 'Prayer at its proper time, then kindness to parents, then Jihad in the cause of Allah.'",
            "source": "Sahih Bukhari"
        },
        {
            "title": "Cleanliness",
            "text": "Maintain cleanliness as it is half of faith. The Prophet ﷺ said: 'Cleanliness is half of faith.' Remember to perform wudu properly and maintain physical cleanliness.",
            "source": "Sahih Muslim"
        },
        {
            "title": "Speaking Good",
            "text": "Guard your tongue and speak only good. The Prophet ﷺ said: 'Whoever believes in Allah and the Last Day should speak good or remain silent.'",
            "source": "Sahih Bukhari and Muslim"
        },
        {
            "title": "Greeting Others",
            "text": "Spread the greeting of Salam. The Prophet ﷺ said: 'You will not enter Paradise until you believe, and you will not believe until you love one another. Shall I tell you something which, if you do it, will make you love one another? Spread the greeting of Salam among you.'",
            "source": "Sahih Muslim"
        },
        {
            "title": "Visiting the Sick",
            "text": "Visit those who are sick. The Prophet ﷺ said: 'When a Muslim visits his sick brother, he is harvesting the fruits of Paradise until he returns.'",
            "source": "Sahih Muslim"
        },
        {
            "title": "Anger Management",
            "text": "Control your anger. The Prophet ﷺ said: 'The strong person is not the one who overcomes people by his strength, but the strong is the one who controls himself while in anger.'",
            "source": "Sahih Bukhari"
        },
        {
            "title": "Good Treatment of Neighbors",
            "text": "Be good to your neighbors. The Prophet ﷺ said: 'Whoever believes in Allah and the Last Day should be good to his neighbor.'",
            "source": "Sahih Bukhari"
        },
        {
            "title": "Honesty in Business",
            "text": "Be honest in your business dealings. The Prophet ﷺ said: 'The honest, trustworthy merchant will be with the Prophets, the truthful, and the martyrs.'",
            "source": "Tirmidhi"
        },
        {
            "title": "Care for Orphans",
            "text": "Show kindness to orphans. The Prophet ﷺ said: 'I and the one who looks after an orphan will be like this in Paradise,' and he raised his forefinger and middle finger together.",
            "source": "Sahih Bukhari"
        },
        {
            "title": "Prayer Times",
            "text": "Guard your prayers and pray them on time. The Prophet ﷺ was asked: 'Which deed is most beloved to Allah?' He replied: 'Prayer at its proper time.'",
            "source": "Sahih Bukhari"
        },
        {
            "title": "Giving Charity",
            "text": "Give charity daily, even if it's little. The Prophet ﷺ said: 'Save yourself from the Fire, even with half a date in charity.'",
            "source": "Sahih Bukhari"
        },
        {
            "title": "Remembering Death",
            "text": "Remember death often. The Prophet ﷺ said: 'Remember frequently the destroyer of pleasures (death).'",
            "source": "Tirmidhi"
        },
        {
            "title": "Learning Knowledge",
            "text": "Seek beneficial knowledge daily. The Prophet ﷺ said: 'Whoever follows a path seeking knowledge, Allah will make easy for him a path to Paradise.'",
            "source": "Sahih Muslim"
        }
    ]
}
